//
//  DataCourseObject.swift
//  180520221301
//
//  Created by Сережа Хазов on 18.05.2022.
//

import SwiftUI

let filmArray: [FilmModel] = [
    FilmModel(filmName: "Флешбэк", aboutFilm: "Алекс Льюис, профессиональный киллер с репутацией, в какой-то момент пошел против ветра, и теперь вынужден отбиваться и от ФБР, и от криминального босса. Все потому, что убийца отказался нарушить свой моральный кодекс.", image: "image1"),
    FilmModel(filmName: "Будь моими глазами", aboutFilm: "Незрячую девушку Софи приглашают в отсутствие хозяев пожить в роскошном уединенном особняке. Вскоре в дом вламываются грабители, и единственная надежда Софи на спасение — приложение, которое позволяет связаться со случайным волонтером, по видеосвязи описывающим происходящее вокруг. Так глазами девушки становится ветеран военной службы Келли. Вместе им предстоит найти выход из жестокой западни…", image: "image2"),
    FilmModel(filmName: "Приплыли!", aboutFilm: "Незадачливый романтик Паша мечтает сделать предложение своей девушке, разыграв на яхте сцену из «Титаника». Однако у отца Паши совсем другие планы — яхта нужна ему, чтобы провернуть одну не очень законную операцию. В итоге морская прогулка оборачивается чередой безумных событий, в которой запланированное кораблекрушение будет далеко не самой большой проблемой.", image: "image3")
]
